{
    "ukhsa": {
        "headline": "Fighting COVID with UKHSA",
        "intro": "Working as part of the UK Health Security Agency as part of the response to the coronavirus pandemic, I performed in a data specialist role encompassing analysis, data science, engineering and devops.",
        "technologies": ["AWS CDK", "AWS Glue", "AWS Lambda", "Python", "Jupyter"],
        "explanation": [
            "In November 2020, I joined the United Kingdom Health Security Agency (UKHSA), then known as the Joint Biosecurity Centre, as a contractor with the purpose to try and leverage data and data science to fight the coronavirus pandemic that was ravaging the country. I was assigned to a new team focused on using waste water (sewage) data to detect outbreaks and measure cases in an area. This was a cutting edge implementation of wastewater based epidemiology at a scale of which had never been seen before anywhere in the world.",
            "First order, producing bespoke visualisations for this new data source to convey simple meanings of complex subject matter",
            "Work on automation and further updates to fully interactive",
            "Work producing risk scores",
            "Work building new DE pipelines",
            "Work fully iac DE solution",
            "Running educational sessions on git and cloud practices for scientists."
        ],
        "outcomes": [
            "Improved health outcomes and provably saved lives by early and accurate detections", 
            "Automation of reporting processes allowed for redistribution of work and generated tens of thousands pounds in efficiency savings", 
            "Fully transformed the data engineering solution to infrastructure as code allowing for rapid deployment and scale ups",
            "Created a ML and rules based system utilising a proprietary algorithm for determining high risk areas and assigning a risk score",
            "Development of sophisticated visualisations allowed for easier insight gathering from our dataset and improved information for policy makers",
            "Built end-to-end data pipelines to ensure high quality, validated data sources in simple outputs for scientific analysis"
        ]
    },
    "insuranceai": {
        "headline": "AI health insurance",
        "intro": "Built a sophisticated reasoning engine and utilised natural language processing to automate the role of underwriters to calculate health insurance policy pricing based on a customers medical history.",
        "technologies": ["Python", "IBM Watson", "NLP", "AWS"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Successful automation of simple cases allowed for reallocation of human resource to complex cases only", 
            "Fully automated pipeline decreased wait time for insurance quote from 6 weeks to minutes",
            "Speed up and resource savings resulted in business savings in excess of £10M"
        ]
    },
    "softwarevalidation": {
        "headline": "Highly Secure Software Validation",
        "intro": "Created a platform to validate and inspect all ingested software for any malicious behaviours before storing in an assured database for secure access.",
        "technologies": ["Javascript", "Ansible", "VMWare", "Apache NiFi"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Successfully built system on time and within budget, preventing costly delays in a £1.5bn project", 
            "System was profiled and redesigned for higher efficiency and utilising new hardware",
            "Fully automated ansible deployment to build solution to VMs with no manual config", 
            "Developed solution into series of linux services for easy running and monitoring"
        ]
    },
    "mlgui": {
        "headline": "Machine Learning GUI",
        "intro": "Graphical user interface to facilitate simple building of machine learning models on a complex World Bank economic dataset as well as storing models and results in a database.",
        "technologies": ["Python", "ReactJS", "NodeJS", "MongoDB", "AWS EC2" ],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Bespoke system allowing for user selection of any features across time ranges and differing countries as well as many different machine learning methods",
            "All results and models were saved to a NoSQL database allowing for faster recall in future if same parameters were entered again",
            "System was hosted entirely in the cloud on AWS"
        ]
    },
    "socialmediagraph": {
        "headline": "Social Media Community Connectedness",
        "intro": "Investigation into Reddit communities and application of several graph algorithms to determine interconnectedness.",
        "technologies": ["Python", "Apache Spark", "Graph Theory"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Implementation of many graphing algorithms including Karger's and in both python and apache spark", 
            "Investigation results successfully mirrored expected outputs indicating a high level of confidence in the implementations",
            "Allowed for deeper investigation of how some social media communities interact and build out visualisations of large graphs of connections between communities"
        ]
    },
    "avatarrecruitment": {
        "headline": "Recruitment Based on Job Simulation",
        "intro": "An ongoing project to build a system to run simulations of people in new jobs to determine best fit and shape recruitment.",
        "technologies": ["Python", "Typescript", "AWS Stack"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Prototype system built which simulates many potential outcomes from placement of an individual in a particular position and uses that to estimate a likelihood of good fit metric", 
            "Proprietary algorithm designed giving 50% better predictions in how someone will fare in a role compared to the average",
            "Do this project more --"
        ]
    }
}