{
    "ukhsa": {
        "headline": "Fighting COVID with UKHSA",
        "intro": "Working as part of the UK Health Security Agency as part of the response to the coronavirus pandemic, I performed in a data specialist role encompassing analysis, data science, engineering and devops.",
        "technologies": ["AWS CDK", "AWS Glue", "AWS Lambda", "Python", "Jupyter"],
        "explanation": [
            "In November 2020, I joined the United Kingdom Health Security Agency (UKHSA), then known as the Joint Biosecurity Centre, as a contractor with the purpose to try and leverage data and data science to fight the coronavirus pandemic that was ravaging the country. I was assigned to a new team focused on using waste water (sewage) data to detect outbreaks and measure cases in an area. This was a cutting edge implementation of wastewater based epidemiology at a scale of which had never been seen before anywhere in the world.",
            "The first project I worked on was to, produce bespoke visualisations for this new data source to convey simple meanings of complex subject matter. We were measuring the amount of covid molecules in the waste water samples which is not a simply understood metric and so it was imperative we made concise and digestible figures with which to display these results. We would then produce reports with our figures which would go to descision makers such as public health officials who would use them as part of their descision making process to shape public health policy. At this stage it was still a very manual process and so this was taking my team and I most of our time each week with the constant stream of data we were receiving each day, as such I began the process of automation.",
            "In the initial automating of this I produced some software to run our figure producing code and create slide decks in a fixed format with new latest figures added. This step of automation was huge for the team as it freed up the majority of everyone else's working time as I could now simply do the job which previously 3 of us were doing all week. This allowed the team to rapidly address other areas of improvement with all the new available time. However, I carried on with the automation work as there were still outstanding issues with it which I wanted to address and so I then, unprompted and single handedly, completely rewrote all of the automation code and figure producing code and created a new report which was fully interactive and functioned much like a dashboard. This allowed for a far deeper level of investigation and insights into our data as well as showing more data as there was no risk of static figures becoming too cluttered, this work was hugely significant and I won an award for my contributions to the civil service.",
            "Another large area of my contributions was on the data engineering side of the project, I did a lot of work designing and building our DE solution. Obviously, we wanted as much data about the pandemic as possible so that we could produce the best possible insights and this meant I was regularly building more and more sophisticated datasets. This work was to abstract any cleaning or processing of the data away from our data scientists and allow them to very simply access reliable and ready to use datasets. Again this removed a lot of unnecessary data wrangling work and saved the organisation many hours of man time which could be better focussed on other problems.",
            "Our data engineering solution was fully cloud based, I was also instrumental in making sure our entire solution was deployed using infrastructure as code. Utilising AWS cloud development kit we ensured the entire solution could rapidly be redeployed and fully functional simply by deploying our code.",
            "I also ran some educational sessions during my time at UKHSA, these focussed on teaching about Git and general cloud practices to the wider team as many of them had no experience with these technologies."
        ],
        "outcomes": [
            "Improved health outcomes and provably saved lives by early and accurate detections", 
            "Automation of reporting processes allowed for redistribution of work and generated tens of thousands pounds in efficiency savings", 
            "Fully transformed the data engineering solution to infrastructure as code allowing for rapid deployment and scale ups",
            "Created a ML and rules based system utilising a proprietary algorithm for determining high risk areas and assigning a risk score",
            "Development of sophisticated visualisations allowed for easier insight gathering from our dataset and improved information for policy makers",
            "Built end-to-end data pipelines to ensure high quality, validated data sources in simple outputs for scientific analysis"
        ]
    },
    "insuranceai": {
        "headline": "AI health insurance",
        "intro": "Built a sophisticated reasoning engine and utilised natural language processing to automate the role of underwriters to calculate health insurance policy pricing based on a customers medical history.",
        "technologies": ["Python", "IBM Watson", "NLP", "AWS"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Successful automation of simple cases allowed for reallocation of human resource to complex cases only", 
            "Fully automated pipeline decreased wait time for insurance quote from 6 weeks to minutes",
            "Speed up and resource savings resulted in business savings in excess of £10M"
        ]
    },
    "softwarevalidation": {
        "headline": "Highly Secure Software Validation",
        "intro": "Created a platform to validate and inspect all ingested software for any malicious behaviours before storing in an assured database for secure access.",
        "technologies": ["Javascript", "Ansible", "VMWare", "Apache NiFi"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Successfully built system on time and within budget, preventing costly delays in a £1.5bn project", 
            "System was profiled and redesigned for higher efficiency and utilising new hardware",
            "Fully automated ansible deployment to build solution to VMs with no manual config", 
            "Developed solution into series of linux services for easy running and monitoring"
        ]
    },
    "mlgui": {
        "headline": "Machine Learning GUI",
        "intro": "Graphical user interface to facilitate simple building of machine learning models on a complex World Bank economic dataset as well as storing models and results in a database.",
        "technologies": ["Python", "ReactJS", "NodeJS", "MongoDB", "AWS EC2" ],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Bespoke system allowing for user selection of any features across time ranges and differing countries as well as many different machine learning methods",
            "All results and models were saved to a NoSQL database allowing for faster recall in future if same parameters were entered again",
            "System was hosted entirely in the cloud on AWS"
        ]
    },
    "socialmediagraph": {
        "headline": "Social Media Community Connectedness",
        "intro": "Investigation into Reddit communities and application of several graph algorithms to determine interconnectedness.",
        "technologies": ["Python", "Apache Spark", "Graph Theory"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Implementation of many graphing algorithms including Karger's and in both python and apache spark", 
            "Investigation results successfully mirrored expected outputs indicating a high level of confidence in the implementations",
            "Allowed for deeper investigation of how some social media communities interact and build out visualisations of large graphs of connections between communities"
        ]
    },
    "avatarrecruitment": {
        "headline": "Recruitment Based on Job Simulation",
        "intro": "An ongoing project to build a system to run simulations of people in new jobs to determine best fit and shape recruitment.",
        "technologies": ["Python", "Typescript", "AWS Stack"],
        "explanation": [
            "This project was -- proj intro",
            "project aims",
            "project challenges",
            "project solution design",
            "project successful outcomes"
        ],
        "outcomes": [
            "Prototype system built which simulates many potential outcomes from placement of an individual in a particular position and uses that to estimate a likelihood of good fit metric", 
            "Proprietary algorithm designed giving 50% better predictions in how someone will fare in a role compared to the average",
            "Do this project more --"
        ]
    }
}